# 1.Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*
# - 6 -> да
# - 7 -> да
# - 1 -> нет

print ('Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.')
day = int(input('Введите день недели цифру от 1 до 7 '))
if 1<= day <=7:
    if day == 6 or day == 7:
        print('это выходной')
    else:
        print('не выходной')
else:
    print("значение больше диапазона от 1 до 7")